# Chap11. 데이터프레임 처리를 위한 Pandas

11.1 Pandas의 기초

In [2]:
#Pandas
import pandas as pd
x= pd.Series([7,3,5,8])
y= pd.Series([7,2,1,7], index=['서울','대구','부산','광주'])
print(x)
print(y)

0    7
1    3
2    5
3    8
dtype: int64
서울    7
대구    2
부산    1
광주    7
dtype: int64

In [2]:
print(y['서울'])
print(y[['서울','대구']])
print(y.index)
print(sorted(y.values))
print(y.reindex(sorted(y.index)))

7
서울    7
대구    2
dtype: int64
Index(['서울', '대구', '부산', '광주'], dtype='object')
[1, 2, 7, 7]
광주    7
대구    2
부산    1
서울    7
dtype: int64

In [3]:
a= pd.Series([3,5,6,2], index=["서울","대구","부산","광주"])
b= pd.Series([2,6,2,8], index=["대구","부산","서울","대전"])
a+b

광주     NaN
대구     7.0
대전     NaN
부산    12.0
서울     5.0
dtype: float64

In [4]:
da= [1,5,3,2,1,5,3]
d= pd.Series(da)
print(pd.unique(d))

ba= ["민준","현우","서연","동현","서연","현우"]
b= pd.Series(ba)
print(pd.unique(b))

[1 5 3 2]
['민준' '현우' '서연' '동현']

In [5]:
age= {'민준':23, '현우':43, '서연':12, '동현':45}
a= pd.Series(age)
a

민준    23
현우    43
서연    12
동현    45
dtype: int64

In [8]:
name= ['민준','서연','현우','민서','동현','수빈']
na= pd.Series(name)
print(na)

na_slicing= na[3:6]
#print(na_slicing[2])
print(na_slicing)
print(na_slicing[5])

0    민준
1    서연
2    현우
3    민서
4    동현
5    수빈
dtype: object
3    민서
4    동현
5    수빈
dtype: object
수빈

In [3]:
#DataFrame
data= {'age':[24,14,25,36],
      'name':['민준','현우','서연','동현'],
      'height':[175.4,180.3,165.8,156.7]}
data= pd.DataFrame(data,columns= ['name','age','height'])
print(data)
print(data.name)
print(data.mean(axis=0))

  name  age  height
0   민준   24   175.4
1   현우   14   180.3
2   서연   25   165.8
3   동현   36   156.7
0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object
age        24.75
height    169.55
dtype: float64

In [11]:
ary= [[1,2],[3,4],[5,6]]
data= pd.DataFrame(ary,columns=['First','Second'])
print(data)
print(data.iloc[1])
print(data.iloc[:,-1])

   First  Second
0      1       2
1      3       4
2      5       6
First     3
Second    4
Name: 1, dtype: int64
0    2
1    4
2    6
Name: Second, dtype: int64

In [12]:
ary= [[1,2],[3,4],[5,6],[7,8],[9,10]]
data= pd.DataFrame(ary, columns=['First','Second'])
print(data.head)
print(data.head(3))
print(data.tail(3))

<bound method NDFrame.head of    First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10>
   First  Second
0      1       2
1      3       4
2      5       6
   First  Second
2      5       6
3      7       8
4      9      10

In [13]:
ary= [[1,2],[3,4],[5,6],[7,8],[9,10]]
data= pd.DataFrame(ary,columns=['First','Second'])
bools= [False,True,True,False,True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [4]:
#pandas의 수학적인 메서드
print(data.mean(axis=0)) #0;행에 대한 평균, 1;열에 대한 평균

age        24.75
height    169.55
dtype: float64

In [6]:
#Pandas의 데이터 형변환
import numpy as np
import pandas as pd

ary= [[1,2],[3,4],[5,6],[7,8],[9,10]]
data= pd.DataFrame(ary,columns=['수온','상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [7]:
data['수온']= data['수온'].astype('float')
data

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [ ]:
#Pandas에서 파일 가져오기
import pandas as pd
food = pd.read_csv("food.csv")
food.head()

In [ ]:
import pandas as pd 
accident = pd.read_csv("acci.csv", engine='python')
accident.head()